Dlubal.RFEM5.IResults
Interface for reading results of chosen loading.

Dlubal.RFEM5.IResults.GetCalculationTime
Gets date and time of the latest calculation.
Returns: Date and time of the latest calculation.

Dlubal.RFEM5.IResults.AddRibsToMembers(System.Boolean)
On members addition of rib components.
Add: If you wish to add rib component on member results then set this parameter to true, otherwise set it to false.

Dlubal.RFEM5.IResults.SubtractRibsFromSurfaces(System.Boolean)
On surfaces subtraction of rib components.
Subtract: If you wish to subtract rib component from surface results then set this parameter to true, otherwise set it to false.

Dlubal.RFEM5.IResults.GetSummary
Gets summary results.
Returns: Results summary.

Dlubal.RFEM5.IResults.GetMaximum
Gets maximum results.
Returns: Maximum results.

Dlubal.RFEM5.IResults.GetNodalSupportForcesCount(System.Int32,System.UInt32,System.Boolean)
Gets count of nodal support forces.
Returns: Count of nodal support forces.
NodeNo: Number or index of the node in which you want to get results.
At: Specifies the type of access.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetNodalSupportForces(System.Int32,System.UInt32,System.Boolean)
Gets array of nodal support forces.
Returns: Array of nodal support forces.
NodeNo: Number or index of the object in which you want to get results.
At: Specifies the type of access.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetNodalExtremeSupportForces(System.Int32,System.UInt32,System.Boolean)
Gets array of extreme nodal support forces.
Returns: Array of extreme nodal support forces.
NodeNo: Number or index of the object in which you want to get results.
At: Specifies the type of access.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetAllNodalSupportForcesCount(System.Boolean)
Gets count of all nodal support forces.
Returns: Count of all nodal support forces.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetAllNodalSupportForces(System.Boolean)
Gets array of nodal support forces in all supported nodes.
Returns: Array of nodal support forces.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetAllNodalExtremeSupportForces(System.Boolean)
Gets array of extreme nodal support forces.
Returns: Extreme results.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetNodalSummarySupportForces(System.Boolean)
Gets array of summary nodal support forces.
Returns: Summary results.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetNodalDeformationsCount(System.Int32,System.UInt32)
Gets nodal deformation count.
Returns: Count of nodal deformations.
NodeNo: Number or index of the node in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetNodalDeformations(System.Int32,System.UInt32)
Gets array of nodal deformations.
Returns: Array of nodal deformations.
NodeNo: Number or index of the node in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetAllNodalDeformationsCount
Gets count of all nodal deformations.
Returns: Count of all nodal deformations.

Dlubal.RFEM5.IResults.GetAllNodalDeformations
Gets array of all nodal deformations.
Returns: Array of nodal deformations.

Dlubal.RFEM5.IResults.GetNodalExtremeDeformations
Gets array of nodal deformations extremes.
Returns: Array of extreme nodal deformations.

Dlubal.RFEM5.IResults.GetLineSupportForcesCount(System.Int32,System.UInt32,System.Boolean)
Gets count of line support forces.
Returns: Count of line support forces.
LineNo: Number or index of the line in which you want to get results.
At: Specifies the type of access.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetLineSupportForces(System.Int32,System.UInt32,System.Boolean)
Gets array of line support forces.
Returns: Array of line support forces.
LineNo: Number or index of the line in which you want to get results.
At: Specifies the type of access.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetLineExtremeSupportForces(System.Int32,System.UInt32,System.Boolean)
Gets array of extreme line support forces.
Returns: Array of extreme line support forces.
LineNo: Number or index of the object in which you want to get results.
At: Specifies the type of access.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetLinesSupportForcesCount(System.Boolean)
Gets count of all line support forces.
Returns: Count of all line support forces.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetLinesSupportForces(System.Boolean)
Gets array of all line support forces.
Returns: Array of line support forces.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetLinesExtremeSupportForces(System.Boolean)
Gets array of extreme line support forces.
Returns: Extreme results.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetLinesSummarySupportForces(System.Boolean)
Gets array of summary line support forces.
Returns: Summary results.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetMemberDeformationsCount(System.Int32,System.UInt32,System.UInt32)
Gets count of member deformations.
Returns: Count of member deformations.
MemberNo: Number or index of the member in which you want to get results.
At: Specifies the type of access.
Axes: Type of results axis.

Dlubal.RFEM5.IResults.GetMemberDeformations(System.Int32,System.UInt32,System.UInt32)
Gets array of member deformations.
Returns: Array of member deformations.
MemberNo: Number or index of the member in which you want to get results.
At: Specifies the type of access.
Axes: Type of results axis.

Dlubal.RFEM5.IResults.GetMemberExtremeDeformations(System.Int32,System.UInt32,System.UInt32)
Gets array of member extreme deformations.
Returns: Array of member extreme deformations.
MemberNo: Number or index of the member in which you want to get results.
At: Specifies the type of access.
Axes: Type of results axis.

Dlubal.RFEM5.IResults.GetMembersDeformationsCount(System.UInt32)
Gets count of all members deformations.
Returns: Count of all member deformations.
Axes: Type of results axis.

Dlubal.RFEM5.IResults.GetMembersDeformations(System.UInt32)
Gets array of all members deformations.
Returns: Array of all members deformations.
Axes: Type of results axis.

Dlubal.RFEM5.IResults.GetMembersExtremeDeformations(System.UInt32)
Gets array of all members extreme deformations.
Returns: Array of all members extreme deformations.
Axes: Type of results axis.

Dlubal.RFEM5.IResults.GetMemberInternalForcesCount(System.Int32,System.UInt32,System.Boolean)
Gets count of member internal forces.
Returns: Count of member internal forces.
MemberNo: Number or index of the member in which you want to get results.
At: Specifies the type of access.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetMemberInternalForces(System.Int32,System.UInt32,System.Boolean)
Gets array of member internal forces.
Returns: Array of member internal forces.
MemberNo: Number or index of the member in which you want to get results.
At: Specifies the type of access.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetMemberExtremeInternalForces(System.Int32,System.UInt32,System.Boolean)
Gets array of member extreme internal forces.
Returns: Array of member extreme internal forces.
MemberNo: Number or index of the member in which you want to get results.
At: Specifies the type of access.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetMembersInternalForcesCount(System.Boolean)
Gets count of all member internal forces.
Returns: Count of all members internal forces.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetMembersInternalForces(System.Boolean)
Gets array of all members internal forces.
Returns: Array of all member internal forces.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetMembersExtremeInternalForces(System.Boolean)
Gets array of all member extreme internal forces.
Returns: Array of all member extreme internal forces.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetMemberContactForcesCount(System.Int32,System.UInt32,System.Boolean)
Gets count of member contact forces.
Returns: Count of member contact forces.
MemberNo: Number or index of the member in which you want to get results.
At: Specifies the type of access.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetMemberContactForces(System.Int32,System.UInt32,System.Boolean)
Gets array of member contact forces.
Returns: Array of member contact forces.
MemberNo: Number or index of the member in which you want to get results.
At: Specifies the type of access.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetMemberExtremeContactForces(System.Int32,System.UInt32,System.Boolean)
Gets array of member extreme contact forces.
Returns: Array of member extreme contact forces.
MemberNo: Number or index of the member in which you want to get results.
At: Specifies the type of access.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetMembersContactForcesCount(System.Boolean)
Gets count of all member contact forces.
Returns: Count of all members contact forces.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetMembersContactForces(System.Boolean)
Gets array of all member contact forces.
Returns: Array of all member contact forces.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetMembersExtremeContactForces(System.Boolean)
Gets array of all member extreme contact forces.
Returns: Array of all member extreme contact forces.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetSetOfMembersInternalForcesCount(System.Int32,System.UInt32,System.Boolean)
Gets count of set of members internal forces.
Returns: Count of set of members internal forces.
SetNo: Number or index of the set of members in which you want to get results.
At: Specifies the type of access.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetSetOfMembersInternalForces(System.Int32,System.UInt32,System.Boolean)
Gets array of set of members internal forces.
Returns: Array of set of members internal forces.
SetNo: Number or index of the set of members in which you want to get results.
At: Specifies the type of access.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetSetOfMembersExtremeInternalForces(System.Int32,System.UInt32,System.Boolean)
Gets array of set of members extreme internal forces.
Returns: Array of set of members extreme internal forces.
SetNo: Number or index of the member in which you want to get results.
At: Specifies the type of access.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetSetsOfMembersInternalForcesCount(System.Boolean)
Gets count of all sets of members internal forces.
Returns: Count of all sets of members internal forces.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetSetsOfMembersInternalForces(System.Boolean)
Gets array of all sets of members internal forces.
Returns: Array of all sets of member internal forces.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetSetsOfMembersExtremeInternalForces(System.Boolean)
Gets array of all sets of members extreme internal forces.
Returns: Array of all sets of members extreme internal forces.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetCrossSectionInternalForcesCount(System.Int32,System.UInt32,System.Boolean)
Gets count of cross-section internal forces.
Returns: Count of cross-section internal forces.
CrossSectionNo: Number or index of the cross-section in which you want to get results.
At: Specifies the type of access.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetCrossSectionInternalForces(System.Int32,System.UInt32,System.Boolean)
Gets array of cross-section internal forces.
Returns: Array of cross-section internal forces.
CrossSectionNo: Number or index of the cross-section in which you want to get results.
At: Specifies the type of access.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetCrossSectionExtremeInternalForces(System.Int32,System.UInt32,System.Boolean)
Gets array of cross-section extreme internal forces extremes.
Returns: Array of cross-section extreme internal forces.
CrossSectionNo: Number or index of the cross-section in which you want to get results.
At: Specifies the type of access.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetCrossSectionsInternalForcesCount(System.Boolean)
Gets count of all cross-sections internal forces.
Returns: Count of all cross-sections internal forces.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetCrossSectionsInternalForces(System.Boolean)
Gets array of all cross-sections internal forces.
Returns: Array of all cross-section internal forces.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetCrossSectionsExtremeInternalForces(System.Boolean)
Gets array of all cross-sections extreme internal forces.
Returns: Array of all cross-section extreme internal forces.
MemberAxes: True if you want to get results in member axes, otherwise the results are in principal axes.

Dlubal.RFEM5.IResults.GetSurfaceDeformationsCount(System.Int32,System.UInt32,System.Boolean)
Gets count of surface deformations.
Returns: Count of surface deformations.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetSurfaceDeformations(System.Int32,System.UInt32,System.Boolean)
Gets array of surface deformations.
Returns: Array of surface deformations.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetSurfacesDeformationsCount(System.Boolean)
Gets count of all surfaces deformations.
Returns: Count of all surfaces deformations.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetSurfacesDeformations(System.Boolean)
Gets array of all surfaces deformations.
Returns: Array of all surfaces deformations.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetSurfaceInternalForcesCount(System.Int32,System.UInt32)
Gets count of surface internal forces.
Returns: Count of surface internal forces.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfaceInternalForces(System.Int32,System.UInt32)
Gets array of surface internal forces.
Returns: Array of surface internal forces.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfacesInternalForcesCount
Gets count of all surfaces internal forces.
Returns: Count of all surfaces internal forces.

Dlubal.RFEM5.IResults.GetSurfacesInternalForces
Gets array of all surfaces forces.
Returns: Array of all surfaces internal forces.

Dlubal.RFEM5.IResults.GetSurfaceBasicStressesCount(System.Int32,System.UInt32)
Gets count of surface basic stresses.
Returns: Count of surface basic stresses.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfaceBasicStresses(System.Int32,System.UInt32)
Gets array of surface basic stresses.
Returns: Array of surface basic stresses.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfacesBasicStressesCount
Gets count of all surfaces basic stresses.
Returns: Count of all surfaces basic stresses.

Dlubal.RFEM5.IResults.GetSurfacesBasicStresses
Gets array of all surface basic stresses.
Returns: Array of all surfaces basic stresses.

Dlubal.RFEM5.IResults.GetSurfacePrincipalStressesCount(System.Int32,System.UInt32)
Gets count of surface principal stresses.
Returns: Count of surface principal stresses.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfacePrincipalStresses(System.Int32,System.UInt32)
Gets array of surface principal stresses.
Returns: Array of surface principal stresses.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfacesPrincipalStressesCount
Gets count of all surfaces principal stresses.
Returns: Count of all surfaces principal stresses.

Dlubal.RFEM5.IResults.GetSurfacesPrincipalStresses
Gets array of all surface principal stresses.
Returns: Array of all surfaces principal stresses.

Dlubal.RFEM5.IResults.GetSurfaceOtherStressesCount(System.Int32,System.UInt32)
Gets count of surface other stresses.
Returns: Count of surface other stresses.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfaceOtherStresses(System.Int32,System.UInt32)
Gets array of surface other stresses.
Returns: Array of surface other stresses.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfacesOtherStressesCount
Gets count of all surfaces other stresses.
Returns: Count of all surfaces other stresses.

Dlubal.RFEM5.IResults.GetSurfacesOtherStresses
Gets array of all surface other stresses.
Returns: Array of all surfaces other stresses.

Dlubal.RFEM5.IResults.GetSurfaceContactStressesCount(System.Int32,System.UInt32)
Gets count of surface contact stresses.
Returns: Count of surface contact stresses.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfaceContactStresses(System.Int32,System.UInt32)
Gets array of surface contact stresses.
Returns: Array of surface contact stresses.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfacesContactStressesCount
Gets count of all surface contact stresses.
Returns: Count of all surfaces contact stresses.

Dlubal.RFEM5.IResults.GetSurfacesContactStresses
Gets array of all surface contact stresses.
Returns: Array of all surfaces contact stresses.

Dlubal.RFEM5.IResults.GetSurfaceEquivalentStressesCount(System.Int32,System.UInt32)
Gets count of surface equivalent stresses.
Returns: Count of surface equivalent stresses.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfaceEquivalentStresses(System.Int32,System.UInt32,System.UInt32)
Gets array of surface equivalent stresses.
Returns: Array of surface equivalent stresses.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.
Hypothesis: Type of the equivalent stresses.

Dlubal.RFEM5.IResults.GetSurfacesEquivalentStressesCount
Gets count of all surface equivalent stresses.
Returns: Count of all surfaces equivalent stresses.

Dlubal.RFEM5.IResults.GetSurfacesEquivalentStresses(System.UInt32)
Gets array of all surface equivalent stresses.
Returns: Array of all surfaces equivalent stresses.
Hypothesis: Type of the equivalent stresses.

Dlubal.RFEM5.IResults.GetSurfaceBasicStrainsCount(System.Int32,System.UInt32)
Gets count of surface basic strains.
Returns: Count of surface basic strains.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfaceBasicStrains(System.Int32,System.UInt32)
Gets array of surface basic strains.
Returns: Array of surface basic strains.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfacesBasicStrainsCount
Gets count of all surfaces basic strains.
Returns: Count of all surfaces basic strains.

Dlubal.RFEM5.IResults.GetSurfacesBasicStrains
Gets array of all surfaces basic strains.
Returns: Array of all surfaces basic strains.

Dlubal.RFEM5.IResults.GetSurfacePrincipalStrainsCount(System.Int32,System.UInt32)
Gets count of surface principal strains.
Returns: Count of surface principal strains.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfacePrincipalStrains(System.Int32,System.UInt32)
Gets array of surface principal strains.
Returns: Array of surface principal strains.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfacesPrincipalStrainsCount
Gets count of all surfaces principal strains.
Returns: Count of all surfaces principal strains.

Dlubal.RFEM5.IResults.GetSurfacesPrincipalStrains
Gets array of all surfaces principal strains.
Returns: Array of all surfaces principal strains.

Dlubal.RFEM5.IResults.GetSurfaceMaximumStrainsCount(System.Int32,System.UInt32)
Gets count of surface maximum strains.
Returns: Count of surface maximum strains.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfaceMaximumStrains(System.Int32,System.UInt32)
Gets array of surface maximum strains.
Returns: Array of surface maximum strains.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfacesMaximumStrainsCount
Gets count of all surfaces maximum strains.
Returns: Count of all surfaces maximum strains.

Dlubal.RFEM5.IResults.GetSurfacesMaximumStrains
Gets array of all surfaces maximum strains.
Returns: Array of all surfaces maximum strains.

Dlubal.RFEM5.IResults.GetSurfaceStrainsCount(System.Int32,System.UInt32)
Gets count of surface strains.
Returns: Count of surface strains.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfaceStrains(System.Int32,System.UInt32,System.UInt32)
Gets array of surface strains.
Returns: Array of surface strains.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.
Hypothesis: Type of the strains.

Dlubal.RFEM5.IResults.GetSurfacesStrainsCount
Gets count of all surfaces strains.
Returns: Count of all surfaces strains.

Dlubal.RFEM5.IResults.GetSurfacesStrains(System.UInt32)
Gets array of all surfaces strains.
Returns: Array of all surfaces strains.
Hypothesis: Type of the strains.

Dlubal.RFEM5.IResults.GetSurfacePlasticStrainsCount(System.Int32,System.UInt32)
Gets count of surface plastic strains.
Returns: Count of surface plastic strains.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfacePlasticStrains(System.Int32,System.UInt32)
Gets array of surface plastic strains.
Returns: Array of surface plastic strains.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfacesPlasticStrainsCount
Gets count of all surfaces plastic strains.
Returns: Count of all surfaces plastic strains.

Dlubal.RFEM5.IResults.GetSurfacesPlasticStrains
Gets array of all surfaces plastic strains.
Returns: Array of all surfaces plastic strains.

Dlubal.RFEM5.IResults.GetSurfaceCrackStrainsCount(System.Int32,System.UInt32)
Gets count of surface crack strains.
Returns: Count of surface crack strains.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfaceCrackStrains(System.Int32,System.UInt32)
Gets array of surface crack strains.
Returns: Array of surface crack strains.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfacesCrackStrainsCount
Gets count of all surfaces crack strains.
Returns: Count of all surfaces crack strains.

Dlubal.RFEM5.IResults.GetSurfacesCrackStrains
Gets array of all surfaces crack strains.
Returns: Array of all surfaces crack strains.

Dlubal.RFEM5.IResults.GetSurfaceCriteriaCount(System.Int32,System.UInt32)
Gets count of surface criteria.
Returns: Count of surface criteria.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfaceCriteria(System.Int32,System.UInt32)
Gets array of surface criteria.
Returns: Array of surface criteria.
SurfaceNo: Number or index of the surface in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSurfacesCriteriaCount
Gets count of all surfaces criteria.
Returns: Count of all surfaces criteria.

Dlubal.RFEM5.IResults.GetSurfacesCriteria
Gets array of all surfaces criteria.
Returns: Array of all surfaces criteria.

Dlubal.RFEM5.IResults.GetSolidDeformationsCount(System.Int32,System.UInt32,System.Boolean)
Gets count of solid deformations.
Returns: Count of solid deformations.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetSolidDeformations(System.Int32,System.UInt32,System.Boolean)
Gets array of solid deformations.
Returns: Array of solid deformations.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetSolidsDeformationsCount(System.Boolean)
Gets count of all solids deformations.
Returns: Count of all solids deformations.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetSolidsDeformations(System.Boolean)
Gets array of all solids deformations.
Returns: Array of all solids deformations.
LocalCS: If true, then the results are in local coordinate system, otherwise are in the global coordinate system.

Dlubal.RFEM5.IResults.GetSolidStressesCount(System.Int32,System.UInt32)
Gets count of solid stresses.
Returns: Count of solid stresses.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSolidStresses(System.Int32,System.UInt32)
Gets array of solid stresses.
Returns: Array of solid stresses.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSolidsStressesCount
Gets count of all solids stresses.
Returns: Count of all solids stresses.

Dlubal.RFEM5.IResults.GetSolidsStresses
Gets array of all solids stresses.
Returns: Array of all solids stresses.

Dlubal.RFEM5.IResults.GetSolidStrainsCount(System.Int32,System.UInt32)
Gets count of solid strains.
Returns: Count of solid strains.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSolidStrains(System.Int32,System.UInt32)
Gets array of solid strains.
Returns: Array of solid strains.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSolidsStrainsCount
Gets count of all solids strains.
Returns: Count of all solids strains.

Dlubal.RFEM5.IResults.GetSolidsStrains
Gets array of all solids strains.
Returns: Array of all solids strains.

Dlubal.RFEM5.IResults.GetSolidPlasticStrainsCount(System.Int32,System.UInt32)
Gets count of solid plastic strains.
Returns: Count of solid plastic strains.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSolidPlasticStrains(System.Int32,System.UInt32)
Gets array of solid plastic strains.
Returns: Array of solid plastic strains.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSolidsPlasticStrainsCount
Gets count of all solids plastic strains.
Returns: Count of all solids plastic strains.

Dlubal.RFEM5.IResults.GetSolidsPlasticStrains
Gets array of all solids plastic strains.
Returns: Array of all solids plastic strains.

Dlubal.RFEM5.IResults.GetSolidCriteriaCount(System.Int32,System.UInt32)
Gets count of solid criteria.
Returns: Count of solid criteria.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSolidCriteria(System.Int32,System.UInt32)
Gets array of solid criteria.
Returns: Array of solid criteria.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSolidsCriteriaCount
Gets count of all solids criteria.
Returns: Count of all solids criteria.

Dlubal.RFEM5.IResults.GetSolidsCriteria
Gets array of all solids criteria.
Returns: Array of all solids criteria.

Dlubal.RFEM5.IResults.GetSolidGasPressureCount(System.Int32,System.UInt32)
Gets count of solid gas pressure.
Returns: Count of solid gas pressure.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSolidGasPressure(System.Int32,System.UInt32)
Gets array of solid gas pressure.
Returns: Array of solid gas pressure.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSolidsGasPressureCount
Gets count of all solids gas pressure.
Returns: Count of all solids gas pressure.

Dlubal.RFEM5.IResults.GetSolidsGasPressure
Gets array of all solids gas pressure.
Returns: Array of all solids gas pressure.

Dlubal.RFEM5.IResults.GetSolidStressesAtCenterOfGravityCount(System.Int32,System.UInt32)
Gets count of solid stresses at center of gravity.
Returns: Count of solid stresses at center of gravity.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSolidStressesAtCenterOfGravity(System.Int32,System.UInt32)
Gets array of solid stresses at center of gravity of FE.
Returns: Array of solid stresses at center of gravity of FE.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSolidsStressesAtCenterOfGravityCount
Gets count of all solids stresses at center of gravity of FE.
Returns: Count of all solids stresses at center of gravity of FE.

Dlubal.RFEM5.IResults.GetSolidsStressesAtCenterOfGravity
Gets array of all solids stresses at center of gravity of FE.
Returns: Array of all solids criteria.

Dlubal.RFEM5.IResults.GetSolidStrainsAtCenterOfGravityCount(System.Int32,System.UInt32)
Gets count of solid strains of center of gravity.
Returns: Count of solid strains at center of gravity.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSolidStrainsAtCenterOfGravity(System.Int32,System.UInt32)
Gets array of solid strains at center of gravity of FE.
Returns: Array of solid strains at center of gravity of FE.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSolidsStrainsAtCenterOfGravityCount
Gets count of all solids strains at center of gravity of FE.
Returns: Count of all solids strains at center of gravity of FE.

Dlubal.RFEM5.IResults.GetSolidsStrainsAtCenterOfGravity
Gets array of all solids strains at center of gravity of FE.
Returns: Array of all solids criteria.

Dlubal.RFEM5.IResults.GetSolidGasPressureCenterCount(System.Int32,System.UInt32)
Gets count of solid gas pressure center.
Returns: Count of solid gas pressure center.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSolidGasPressureCenter(System.Int32,System.UInt32)
Gets array of solid gas pressure center.
Returns: Array of solid gas pressure center.
SolidNo: Number or index of the solid in which you want to get results.
At: Specifies the type of access.

Dlubal.RFEM5.IResults.GetSolidsGasPressureCenterCount
Gets count of all solids gas pressure center.
Returns: Count of all solids gas pressure center.

Dlubal.RFEM5.IResults.GetSolidsGasPressureCenter
Gets array of all solids gas pressure center.
Returns: Array of all solids gas pressure center.